#include <iostream>
using namespace std;
int main()
{
    //1.Написать программу, которая находит и выводит все простые числа от 1 до 200.

    setlocale(0, "");
    cout << "Hello World!\n";
    for (int i = 1; i<201;i++)
    {
        cout << i << " ";
    }
    system("pause");
}